<script setup lang="ts">
import { ref } from "vue";

// Контент для подробного описания
const detailContent = ref(`
  <p>Наша фирма предлагает Вам услугу ламинирование документов , которая защитит Вашу документацию от влаги, воздуха, пыли, а также от складывания, трения, перегибания и царапин. Наши специалисты с помощьюламинирования  пытаются сохранить и защитить документы от преждевременной порчи и ветхости. Разорвать заламинированый документ практически невозможно. <br><br></p>
`);
const detailContent2 = ref(`
	<p>Ламинирование  выполняют со всеми типами документов.
Идентификационный код, свидетельство о браке, приложение к диплому, пропуск, а также ламинирование  используют для ламинации карточек, удостоверений, обложек на книги, меню для другой бумажной продукции, которая часто используется.<br>
Существует несколько видов ламинирования : пакетное и рулонное, наша фирма выполняет оба вида  ламинирования . Пакетное ламинирование  – это хороший вариант для ламинации единичных листов. Рулонная ламинация – процесс покрытия изделия пленкой, которая имеет вид рулона и в ходе ламинирования  разматывается с него. Эта ламинация  предназначена для изготовления листовой печатной продукции. Ламинация бывает односторонняя и двухсторонняя.Существует матовая и глянцевая пакетная и рулонная ламинация. На матовой можно писать ручкой и карандашом, она чаще всего используется на брошюрах, рекламных буклетах и визитках, а глянцевая делает тусклые краски более насыщенными и яркими. Специалисты нашей фирмы так же используют холодную и горячую пакетную и рулонную ламинацию.<br><br>
Горячее ламинирование  делается на ламинаторах специального типа, для ламинирования документов  от небольших форматов до больших форматов промышленных размеров. Холодное же способно ламинировать полиграфическую продукцию с не термоустойчивой краской, а также ламинировать синтетические материалы.<br>
Преимущества ламинирования документов :<br>
- Укрепление и сохранение цвета и контрастности изображения;<br>
- Долговременная защита документов, которые нуждаются в частом использовании, становятся практически неуязвимыми;<br>
- Избежание - складок, морщинок, повреждений от солнца, разрывов, пятен, отпечатков пальцев и жира;<br>
- Быстрый и надежный способ защиты ваших документов от промокания и истирания.<br>
 С помощью ламинирования  Ваш документ примет более презентабельный вид.</p>
`);
</script>

<template>
  <div class="main-content">
    <div class="tab-con">
      <div class="tab-btn-con">
        <NuxtLink
          to="/printing/lamination/doc"
          class="tab-btn"
          :class="{
            active: $route.path === '/printing/lamination/doc',
          }"
        >
          Ламинирование документов
        </NuxtLink>

        <NuxtLink
          to="/printing/lamination/large"
          class="tab-btn"
          :class="{
            active: $route.path === '/printing/lamination/large',
          }"
        >
          Широкоформатное ламинирование
        </NuxtLink>
        <NuxtLink
          to="/printing/lamination/more"
          class="tab-btn"
          :class="{
            active: $route.path === '/printing/lamination/more',
          }"
        >
          Подробнее
        </NuxtLink>
      </div>
    </div>

    <PageDetail
      title="Ламинирование"
      :content="detailContent"
      :content2="detailContent2"
      image="/img/lam/3.png"
    />
  </div>
</template>

<style scoped>
</style>
